In [1]:
import numpy as np
import pandas as pd
import seaborn as sn
import matplotlib.pyplot as plt

In [2]:
data=pd.read_csv('C:\\Users\\Dell\\Downloads\\weather.csv.txt')

In [3]:
data

          City  Fall  Winter  Spring  Summer
0       London    68      94     103      21
1        Paris    46      86      26      70
2     New York   106     105      84      70
3        Dubai   107     102      94      21
4        Tokyo   100      87      59      38
5    Singapore    55     103      43      64
6  Los Angeles    75      74      69      84
7    Barcelona    57      57      57      92
8       Madrid    66     106      39      20

In [5]:
# 1) create a new dataframe using the 'weather' dataframe the season columns' values into a single one. 
# The 4 season value should be stored in a column 'season'. The temperature values should be stored in a column 
# called 'Temperature'.
weather=pd.DataFrame({'City':['London','London','London','London'],
                      'Season':['Fall','Winter','Spring','Summer'],
                      'Temperature':[68,94,103,21]})
weather

     City  Season  Temperature
0  London    Fall           68
1  London  Winter           94
2  London  Spring          103
3  London  Summer           21

In [8]:
from datetime import datetime, timedelta
indepday = datetime(1947, 8, 15)

curr_date = datetime.now()
date_range = pd.date_range(start=curr_date, end=indepday - timedelta(days=1))

date = pd.DataFrame({
    'day': [date.day for date in date_range],
    'month': [date.month for date in date_range],
    'year': [date.year for date in date_range]
});
date.to_csv('date_range.csv', index=False)
print(date_df.head())

Empty DataFrame
Columns: [day, month, year]
Index: []